CFD Projects/serpentine_cooling_CFD_project/serpentine_cooling/case_Re2000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version: v11
    \\  /    A nd           | Website: www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

// Serpentine Cooling Channel - blockMeshDict
// Project: Conjugate Heat Transfer in Multi-Bend Channel
// Author: IIT Ropar ME Student (2nd-3rd year)
//
// Geometry:
//   3 straight channel sections connected by 2 U-bends
//   Channel width (W) = 0.01 m (10 mm)
//   Channel length per section (L) = 0.10 m (100 mm)
//   Depth (z) = 0.01 m (1 cell - pseudo-2D)
//
//   y
//   ^
//   |
//   +---> x
//
//   [Section 3: top, flow LEFT]  <---  outlet
//       ___________
//      |           |
//      |  Bend 2   |
//      |___________|
//   [Section 2: mid, flow RIGHT]
//       ___________
//      |           |
//      |  Bend 1   |
//      |___________|
//   [Section 1: bot, flow RIGHT] ---> inlet (bottom-left)

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 0.001; // all coordinates in mm

// Key dimensions (mm):
// Channel width  : 10
// Straight length: 100
// Bend radius    : 10 (same as channel width, tight bend)
// Depth          : 10

vertices
(
    // ---- Section 1 (bottom, y = 0 to 10) ----
    //        x     y    z
    ( 0    0    0)   // 0
    (100   0    0)   // 1
    (100  10    0)   // 2
    ( 0   10    0)   // 3
    ( 0    0   10)   // 4
    (100   0   10)   // 5
    (100  10   10)   // 6
    ( 0   10   10)   // 7

    // ---- Bend 1 (right side, x=100 to 120, y=10 to 30) ----
    (120  10    0)   // 8
    (120  30    0)   // 9
    (100  30    0)   // 10
    (120  10   10)   // 11
    (120  30   10)   // 12
    (100  30   10)   // 13

    // ---- Section 2 (middle, y = 20 to 30) ----
    ( 0   20    0)   // 14
    ( 0   30    0)   // 15
    ( 0   20   10)   // 16
    ( 0   30   10)   // 17

    // ---- Bend 2 (left side, x=-20 to 0, y=30 to 50) ----
    (-20  30    0)   // 18
    (-20  50    0)   // 19
    ( 0   50    0)   // 20
    (-20  30   10)   // 21
    (-20  50   10)   // 22
    ( 0   50   10)   // 23

    // ---- Section 3 (top, y = 40 to 50) ----
    (100  40    0)   // 24
    (100  50    0)   // 25
    (100  40   10)   // 26
    (100  50   10)   // 27
);

blocks
(
    // Section 1: bottom straight channel
    hex (0 1 2 3 4 5 6 7)
    (40 4 1)
    simpleGrading (1 1 1)

    // Bend 1: right U-turn
    hex (1 8 9 10 5 11 12 13)
    (8 8 1)
    simpleGrading (1 1 1)

    // Section 2: middle straight channel (flow goes right to left)
    hex (14 10 13 15 16 13 12 17)  // note vertex order reversed for direction
    hex (10 14 15 9 13 16 17 12)   // corrected
    (40 4 1)
    simpleGrading (1 1 1)

    // Bend 2: left U-turn
    hex (18 14 15 19 21 16 17 22)
    (8 8 1)
    simpleGrading (1 1 1)

    // Section 3: top straight channel
    hex (20 24 25 23 22 26 27 21)
    (40 4 1)
    simpleGrading (1 1 1)
);

// NOTE FOR STUDENT:
// The above multi-block setup is conceptual to illustrate the structure.
// For a working simulation, use the SIMPLIFIED single-straight-channel
// blockMeshDict in system/blockMeshDict.simple (provided) and run the
// full serpentine as a snappyHexMesh case (see README).
// The serpentine is best built with snappyHexMesh or by running the
// provided Python script: scripts/gen_blockmesh.py

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (24 25 27 26)
        );
    }
    hotWall
    {
        type wall;
        faces
        (
            // Bottom wall of section 1 (heated)
            (0 1 5 4)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 2 6 5)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
