CFD Projects/serpentine_cooling_CFD_project/serpentine_cooling/case_Re2000/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  Serpentine Cooling Channel - controlDict
  Solver: buoyantSimpleFoam (steady-state, buoyancy + heat transfer)
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     buoyantSimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000;          // iterations (SIMPLE is pseudo-time)

deltaT          1;

writeControl    timeStep;
writeInterval   200;           // write every 200 iterations

purgeWrite      3;             // keep only last 3 time directories

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ---- Function objects: monitor residuals and Nusselt number ----
functions
{
    residuals
    {
        type            residuals;
        libs            (utilityFunctionObjects);
        writeControl    timeStep;
        writeInterval   1;
        fields          (p_rgh U T k epsilon);
    }

    wallHeatFlux
    {
        type            wallHeatFlux;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        patches         (hotWall);
    }

    fieldAverage
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        timeStart       1500;       // average over last 500 iterations
        fields
        (
            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
            T
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
        );
    }
}
